DustinWatts/esp32-touchdown/boards.txt
esp32_touchdown.name=ESP32 TouchDown

esp32_touchdown.upload.tool=esptool_py
esp32_touchdown.upload.maximum_size=1310720
esp32_touchdown.upload.maximum_data_size=327680
esp32_touchdown.upload.wait_for_upload_port=true
esp32_touchdown.upload.speed=921600

esp32_touchdown.serial.disableDTR=true
esp32_touchdown.serial.disableRTS=true

esp32_touchdown.build.mcu=esp32
esp32_touchdown.build.core=esp32
esp32_touchdown.build.variant=esp32
esp32_touchdown.build.board=ESP32_DEV

esp32_touchdown.build.f_cpu=240000000L
esp32_touchdown.build.flash_size=4MB
esp32_touchdown.build.flash_freq=80m
esp32_touchdown.build.flash_mode=dio
esp32_touchdown.build.boot=dio
esp32_touchdown.build.partitions=default
esp32_touchdown.build.defines=

esp32_touchdown.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32_touchdown.menu.PartitionScheme.default.build.partitions=default
esp32_touchdown.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32_touchdown.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32_touchdown.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
esp32_touchdown.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32_touchdown.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32_touchdown.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32_touchdown.menu.PartitionScheme.minimal.build.partitions=minimal
esp32_touchdown.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32_touchdown.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32_touchdown.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32_touchdown.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32_touchdown.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32_touchdown.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32_touchdown.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32_touchdown.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32_touchdown.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32_touchdown.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32_touchdown.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32_touchdown.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32_touchdown.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32_touchdown.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32_touchdown.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32_touchdown.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32_touchdown.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32_touchdown.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32_touchdown.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
esp32_touchdown.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32_touchdown.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32_touchdown.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
esp32_touchdown.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32_touchdown.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

esp32_touchdown.menu.DebugLevel.none=None
esp32_touchdown.menu.DebugLevel.none.build.code_debug=0
esp32_touchdown.menu.DebugLevel.error=Error
esp32_touchdown.menu.DebugLevel.error.build.code_debug=1
esp32_touchdown.menu.DebugLevel.warn=Warn
esp32_touchdown.menu.DebugLevel.warn.build.code_debug=2
esp32_touchdown.menu.DebugLevel.info=Info
esp32_touchdown.menu.DebugLevel.info.build.code_debug=3
esp32_touchdown.menu.DebugLevel.debug=Debug
esp32_touchdown.menu.DebugLevel.debug.build.code_debug=4
esp32_touchdown.menu.DebugLevel.verbose=Verbose
esp32_touchdown.menu.DebugLevel.verbose.build.code_debug=5

##############################################################